[
    {
        "header": "Week 1",
        "outcomes": "Introduction and data types",
        "CalendarInfo": " Dates: 3/28/22 - 4/1/22<br> Welcome! See you Monday in Warren Lecture Hall. Please take our <a href=\"https://forms.gle/gvibFnNixxqcWbaU8\" target=\"_blank\">pre-class survey.</a> ",
        "ExpandInCalendar": true,
        "content": [
            {
                "name": "Notes",
                "source": "Week1.tex"
            }, 
            {
                "name": "Lecture and Discussion podcast",
                "source": "<p>See <a href=\"https://podcast.ucsd.edu/watch/fa21/cse20_a00/1\">videos on podcast.ucsd.edu</a> for Week 0 Friday and Week 1 Monday and Wednesday. See <a href=\"https://youtu.be/4i47EJ4yNaY\" target=\"_blank\">Week 1 Friday video on YouTube</a></p>"
            },
            {
                "name": "Discussion slides",
                "source": "<p><a href=\"../files/DiscussionWeek1annotated.pptx\">Download pptx slides</a></p>"
            },
            {
                "name": "Lecture Hall (Week 0)",
                "source": "<br><iframe height=\"600px\" width=\"100%\" src=\"https://map.concept3d.com/?id=1005#!w/32.8738,-117.24095,0;32.88187,-117.23338,0;0\" frameborder=\"0\"></iframe>"
            },
            {
                "name": "(Video) Course Intro",
                "source": "https://www.youtube.com/embed/2KbOaCLS-cQ"
            },
            {
                "name": "(Video) Week 1 Friday",
                "source": "https://youtu.be/4i47EJ4yNaY"
            }

        ],

        "Due Dates": [
            {
                "name": "Review Quiz",
                "link": "https://gradescope.com",
                "due": "10/1/21 at 5pm"
            }
        ]
    },
    {
        "header": "Finals week",
        "outcomes": "Final exam",
        "CalendarInfo":  "Dates: TBD. Final exam opens TBD. ",
        "ExpandInCalendar": true,
        "content": [
            {
                "name": "Final exam details",
                "source": "<p>Final exam:</p><p>Why? To review the entire quarter and solidify your understanding of this foundational material.</p><p>How? Cumulative quiz on class content. This will be an online assignment on Gradescope available for 24 hours including the scheduled final exam time. Once you begin the exam, you will have 2.5 hours to complete it. The exam is designed to require approximately 1 hour; the extra time is available to help account for technical issues with taking an online exam. The exam must reflect your own independent effort. The exam may have a combination of True/False, multiple choice, select-all-that-apply, and free-response questions. To be fair to those in other time zones who may be taking the exam while I am asleep and therefore can't answer questions, I (and the TAs/tutors) will not answer any questions about the exam during the exam period. If any bugs are found in the exam after the exam period, the affected question(s) will be removed. To take the exam, ensure you are located somewhere with reliable internet for the duration of your exam. The scheduled exam room will be available for those who would like. The exam will be open-book: you may use your notes for CSE 20, along with all provided CSE 20 class material this quarter. No collaboration or help-seeking / help-giving will be allowed. No online resources other than those provided for this quarter's CSE 20 offering are allowed.</p>"
            }
        ],
        "Due Dates": [
            {
                "name": "Final exam",
                "due": "TBA"
            }
        ]
    }
]